----------------------------------------------------------------
        Layer (type)               Output Shape         Param #
================================================================
            Conv2d-1         [-1, 16, 224, 224]           5,200
       BatchNorm2d-2         [-1, 16, 224, 224]              32
            Conv2d-3         [-1, 32, 112, 112]           8,224
       BatchNorm2d-4         [-1, 32, 112, 112]              64
            Conv2d-5           [-1, 64, 56, 56]          32,832
       BatchNorm2d-6           [-1, 64, 56, 56]             128
            Conv2d-7           [-1, 64, 56, 56]          36,928
       BatchNorm2d-8           [-1, 64, 56, 56]             128
            Conv2d-9           [-1, 64, 56, 56]          36,928
      BatchNorm2d-10           [-1, 64, 56, 56]             128
    ResidualBlock-11           [-1, 64, 56, 56]               0
           Conv2d-12           [-1, 64, 56, 56]          36,928
      BatchNorm2d-13           [-1, 64, 56, 56]             128
           Conv2d-14           [-1, 64, 56, 56]          36,928
      BatchNorm2d-15           [-1, 64, 56, 56]             128
    ResidualBlock-16           [-1, 64, 56, 56]               0
           Conv2d-17           [-1, 64, 56, 56]          36,928
      BatchNorm2d-18           [-1, 64, 56, 56]             128
           Conv2d-19           [-1, 64, 56, 56]          36,928
      BatchNorm2d-20           [-1, 64, 56, 56]             128
    ResidualBlock-21           [-1, 64, 56, 56]               0
           Conv2d-22           [-1, 64, 56, 56]          36,928
      BatchNorm2d-23           [-1, 64, 56, 56]             128
           Conv2d-24           [-1, 64, 56, 56]          36,928
      BatchNorm2d-25           [-1, 64, 56, 56]             128
    ResidualBlock-26           [-1, 64, 56, 56]               0
           Conv2d-27           [-1, 64, 56, 56]          36,928
      BatchNorm2d-28           [-1, 64, 56, 56]             128
           Conv2d-29           [-1, 64, 56, 56]          36,928
      BatchNorm2d-30           [-1, 64, 56, 56]             128
    ResidualBlock-31           [-1, 64, 56, 56]               0
  ConvTranspose2d-32         [-1, 32, 113, 113]          32,800
      BatchNorm2d-33         [-1, 32, 113, 113]              64
  ConvTranspose2d-34         [-1, 16, 225, 225]           8,208
      BatchNorm2d-35         [-1, 16, 225, 225]              32
  ConvTranspose2d-36         [-1, 16, 225, 225]          20,752
          Dropout-37         [-1, 16, 225, 225]               0
           Conv2d-38          [-1, 1, 224, 224]              65
          Dropout-39         [-1, 16, 225, 225]               0
           Conv2d-40          [-1, 1, 224, 224]              65
          Dropout-41         [-1, 16, 225, 225]               0
           Conv2d-42          [-1, 1, 224, 224]              65
          Dropout-43         [-1, 16, 225, 225]               0
           Conv2d-44          [-1, 1, 224, 224]              65
================================================================
Total params: 479,156
Trainable params: 479,156
Non-trainable params: 0
----------------------------------------------------------------
Input size (MB): 0.77
Forward/backward pass size (MB): 110.74
Params size (MB): 1.83
Estimated Total Size (MB): 113.34
----------------------------------------------------------------
